<?php
return array(
    // 公司默认角色和对应节点权限
    'company_default_role'       => array(
        array(
            'name'        => '初审人员',
            'desc'        => '负责公司信审工作',
            'menu_id'     => '1,8,9,160,161,162',
            'admin_class' => '1',
        ),
        array(
            'name'        => '贷后人员',
            'desc'        => '负责公司贷后管理工作',
            'menu_id'     => '4,17,18,19,22,173,174,175,176,177,178,179,180,198',
            'admin_class' => '2',
        ),
        array(
            'name'        => '信审主管',
            'desc'        => '负责分配，协调信审工作',
            'menu_id'     => '1,8,9,160,161,162,163,164,165,166',
            'admin_class' => '3',
        ),
        array(
            'name'        => '贷后主管',
            'desc'        => '负责公司贷后管理工作',
            'menu_id'     => '4,17,18,19,20,22,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,198',
            'admin_class' => '4',
        ),
        array(
            'name'        => '终审人员',
            'desc'        => '负责公司信审工作',
            'menu_id'     => '1,8,9,160,161,162',
            'admin_class' => '7',
        ),
        //array(
        //    'name'        => '运营',
        //    'desc'        => '负责公司运营和数据分析',
        //    'menu_id'     => '10,11,12,13,14,16,27,28,29,152,153,167,168,169,170,171,172',
        //    'admin_class' => '0',
        //),
        //array(
        //    'name'        => '商务',
        //    'desc'        => '负责公司商务',
        //    'menu_id'     => '14,15,16,167,168,169,170,171,1722',
        //    'admin_class' => '0',
        //),
    ),
    // 公司管理员节点权限
    'company_default_admin_menu' => '1,2,4,5,6,8,9,10,11,12,13,17,18,19,20,21,22,23,24,26,27,28,29,152,153,154,155,156,157,160,161,162,163,164,165,166,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199',
);